{
  "name": "mold-breaker",
  "caption": "Mold Breaker",
  "gen": "generation-iv",
  "effect": {
    "short": "Bypasses targets' abilities if they could hinder or prevent a move.",
    "full": "This Pokémon's moves completely ignore abilities that could hinder or prevent their effect on the target.\n\nFor example, this Pokémon's moves ignore abilities that would fully negate them, such as []{ability:water-absorb}; abilities that would prevent any of their effects, such as []{ability:clear-body}, []{ability:shell-armor}, or []{ability:sticky-hold}; and abilities that grant any general protective benefit, such as []{ability:simple}, []{ability:snow-cloak}, or []{ability:thick-fat}.  If an ability could either hinder or help this Pokémon's moves, e.g. []{ability:dry-skin} or []{ability:unaware}, the ability is ignored either way.\n\nAbilities that do not fit this description, even if they could hinder moves in some other way, are not affected.  For example, []{ability:cursed-body} only affects potential future uses of the move, while []{ability:liquid-ooze} and []{ability:shadow-tag} can only hinder a move's effect on the user.  This ablity cannot ignore type or form changes granted by abilities, for example []{ability:color-change} or []{ability:forecast}; nor effects that were caused by abilities but are no longer tied to an ability, such as the rain from []{ability:drizzle}.  This ability cannot ignore []{ability:multitype} at all.\n\nAn ability ignored by this ability is only nullified while the move is being used.  For example, this Pokémon's moves can [paralyze]{mechanic:paralysis} a Pokémon with []{ability:limber}, but Limber will activate and heal the paralysis immediately thereafter, and this Pokémon's []{move:spikes} are not affected by this ability after they have been placed.\n\nWhen this Pokémon enters battle, all participating trainers are notified that it has this ability.\n\nThis ability functions identically to []{ability:teravolt} and []{ability:turboblaze}."
  },
  "flavorText": "Moves can be used on the target regardless of\nits Abilities.",
  "pokemon": {
    "pinsir": 2,
    "cranidos": 1,
    "rampardos": 1,
    "drilbur": "hidden",
    "excadrill": "hidden",
    "throh": "hidden",
    "sawk": "hidden",
    "basculin-red-striped": "hidden",
    "axew": 2,
    "fraxure": 2,
    "haxorus": 2,
    "druddigon": "hidden",
    "pancham": 2,
    "pangoro": 2,
    "hawlucha": "hidden",
    "basculin-blue-striped": "hidden",
    "gyarados-mega": 1,
    "ampharos-mega": 1
  }
}
